package main

func main() {
	//数组写法（可以修改，不能扩容或缩小）
	lst1 := [3]string{"a", "b", "c"}            // 创建一个长度为3的数组
	lst2 := [...]string{"a", "b", "c"}          //创建一个自动计算数组长度的数组，取决于{}里面的数量
	lst3 := [...]string{0: "a", 2: "b", 3: "c"} //创建一个长度为4的数组，["a","","b","c"]
	//切片写法(可以修改或扩容，缩小)
	lst4 := []string{"a", "b", "c"}          //创建一个长度为3的切片
	lst5 := []string{0: "a", 2: "b", 3: "c"} //创建一个长度为4的切片["a","","b","c"]
	lst6 := make([]string, 3, 5)             //使用make创建一个长度为3（前三个可访问），容量为5（底层数组为5个）
	//从数组或切片里面重新做切片
	lst7 := lst1[1:2] //从数组重新做切片
	lst8 := lst4[1:2] //从切片里面重新做切片
}
